<template>
  <div>
    <div>
      <a href="https://t.me/bot0ru" style="border:1px solid black; padding:10px;color:black">Заказать накрутку</a>
      <main class="intro container--intro">
        <div class="intro__carts">
          <div class="intro__cart">
            
            <h1 class="intro__cart__title">{{ this.title }}</h1>
            
          </div>
          <div class="intro__text">
            <h2 class="intro__content">{{ this.description }}</h2>
          </div>
          
        </div>
      </main>
      <a href="https://t.me/bot0ru" style="border:1px solid black; padding:10px;color:black">Заказать накрутку</a>
      

      <div v-for="(item, i) of titleMeta" :key="i" style="opacity:0">
        <div class="next">
          <div class="next__inner container--intro">
            <!-- <button class="next__btn"> -->
            <nuxt-link class="next__btn" :to="`/${i}`">
              {{ item }}
            </nuxt-link>
            <!-- </button> -->
          </div>
        </div>
      </div>

      <footer class="footer">
        <div class="footer__inner container--intro">
          <h3 class="2022 nft">2023 {{ this.title }}</h3>
          <div class="footer__social"></div>
        </div>
      </footer>
    </div>
  </div>
</template>

<script>
export default {
  name: "App",

  data() {
    return {
      title: "",
      description: "",
      titleMeta: [
        'накрутка пф',
        'накрутка пф быдлокодер',
        'программы накрутки пф',
        'накрутка пф пф топ',
        'накрутка пф webvisitor',
        'сервис накрутки пф',
        'накрутка пф яндекс',
        'накрутка пф пф топ быдлокодер',
        'программа накрутки пф webvisitor',
        'накрутка пф накрутка пф рф',
        'накрутка пф сайт',
        'накрутка пф заказать',
        'накрутка пф ботами',
        'накрутка пф купить',
        'накрутка пф top maker',
        'накрутка пф webvisitor быдлокодер',
        'программы накрутки пф быдлокодер',
        'накрутка пф t me s yandex bots',
        'накрутка пф 2021',
        'накрутка пф бесплатно',
        'накрутка пф москва',
        'накрутка пф топ мейкер',
        'накрутка пф бесплатно форум',
        'накрутка пф цена',
        'топ мэйкер накрутка пф',
        'накрутка пф кворк',
        'накрутка пф +что +такое форум',
        'накрутка пф накрутки поведенческих',
        'накрутка пф рост трафика',
        'курс +по накрутке пф',
        'накрутка пф fasttop',
        'накрутка пф tdn',
        'накрутка пф авито',
        'специалист +по накрутке пф +в яндексе',
        'накрутка пф wsait',
        'накрутка пф +не дает реального прироста трафика',
        'программа накрутки пф webvisitor быдлокодер',
        'накрутка пф иванов',
        'накрутка пф поведенческих факторов',
        'накрутка пф фастоп',
        'накрутка пф яндекс быдлокодер',
        'курс иванова +по накрутке пф',
        'накрутка пф онлайн',
        'накрутка пф заказать быдлокодер',
        'накрутка пф top maker быдлокодер',
        'накрутка пф москва быдлокодер',
        'топ мэйкер накрутка пф быдлокодер',
        'накрутка пф фасттоп',
        'накрутка пф ботами быдлокодер',
        'накрутка пф топ мейкер быдлокодер',
        'как накрутить подписчиков в инстаграме',
        'накрутить лайки на аватарку',
        'пенсионный фонд кубышка',
        'как накрутить подписчиков в лайке 2023',
        'как накрутить счетчик',
        'накрутить подписчиков в инстаграмме',
        'накрутить лайки',
        'справка из пфр о неполучении пенсии',
        'накрученные паблики пессимизируются в ленте',
        'увеличение пенсии с 1 июля',
        'максимальное количество пенсионных баллов',
        'баллы пенсионного фонда',
        'накрутить подписчиков бесплатно',
        'как накручивать поведенческие факторы',
        'осфр пенсионный фонд',
        'как накрутить подписчиков в дзене',
        'раскрутка подписчиков инстаграме бесплатно',
        'подписчики инстаграм накрутить',
        'увеличение пенсии в 2024',
        'подписчики инстаграм накрутить бесплатно',
        'накрутка поведенческих факторов',
        'накрутка поведенческих факторов программа',
        'накрутка поведенческих факторов яндекс',
        'топ накрутка поведенческих факторов',
        'накрутка пф поведенческих факторов',
        'накрутка поведенческих факторов топ мейкер',
        'накрутка поведенческих факторов скачать',
        'накрутка поведенческого фактора рф',
        'накрутка пф поведенческих факторов рф',
        'программа +для накрутки поведенческих факторов скачать',
        'накрутка поведенческих факторов сайта',
        'программа +для накрутки поведенческих факторов сайта',
        'сервис +по накрутке поведенческих факторов',
        'накрутка поведенческих факторов программа быдлокодер',
        'накрутка поведенческого фактора авито',
        'софт +для накрутки поведенческих факторов',
        'приложение +для накрутки поведенческих факторов',
        'накрутка поведенческих факторов top maker',
        'накрутка поведенческих факторов топ мэйкер',
        'накрутка поведенческих факторов bumbastik',
        'обучение накрутке поведенческих факторов',
        'приложение +для накрутки поведенческих факторов сайта',
        'накрутка пф программа поведенческий фактор',
        'бот +для накрутки поведенческих факторов',
        'накрутка поведенческих факторов бумабастик',
        'поведенческие факторы яндекс накрутка пф',
        'заказать накрутку поведенческих факторов',
        'скачать программа +для накрутки поведенческих факторов сайта',
        'накрутка поведенческих факторов t me',
        'накрутка поведенческих факторов 2023',
        'накрутка поведенческих факторов курс',
        'бесплатная накрутка поведенческих факторов',
        'накрутка поведенческих факторов без заданий',
        'поведенческие факторы накрутка топмейкер',
        'накрутка поведенческих факторов цена',
        'накрутка поведенческих факторов программа gofuckbiz',
        'накрутка поведенческих факторов купить',
        'санкции +за накрутку поведенческих факторов',
        'накрутка пф яндекс топ поведенческих факторов',
        'накрутка поведенческих факторов программа топ мейкер',
        'скрипт накрутки поведенческого фактора',
        'накрутка поведенческих факторов программа gofuckbiz 55316',
        'накрутка поведенческих факторов fasttop',
        'накрутка поведенческих факторов яндекс yatopeasy',
        'курс +по накрутке поведенческих факторов скачать',
        'программа накрутки поведенческих факторов top maker',
        'накрутка поведенческих факторов программа топмейкер',
        'накрутка поведенческих факторов программа +за traff',
        'накрутка поведенческих факторов фасттоп',
        'обучение накрутки поведенческих факторов yatopeasy',
        'оратор манипулирующий фактами',
        'ревмофактор повышен при каких заболеваниях',
        'pws методика психология',
        'люди икс 2 2003',
        'участники шоу влюбись если сможешь',
        'как набрать подписчиков в лайке',
        'как набрать аудиторию в телеграмме',
        'обучение модификации поведения человека',
        'голосовать на муз раскрутка',
        'обучение модификации поведения человека манхва',
        'как правильно пить энергетик чтобы был эффект',
        'усилитель уходит в защиту при увеличении громкости',
        'накрутить подписчиков в лайке бесплатно и быстро',
        'накрутить подписчиков в группу вк',
        'мама я крутой я пью энергетики',
        'как раскрутить группу в телеграмме',
        'как накрутить себе подписчиков в лайке',
        'популярные книги по психологии и саморазвитию',
        'исключение жестких приказов усиление роли этикета включает',
        'эффективные инструменты продвижения госпабликов',
        'поведенческие факторы',
        'накрутка поведенческих факторов',
        'поведенческие факторы t me s yandex bots',
        'программа поведенческий фактор',
        'накрутка поведенческих факторов программа',
        'поведенческие факторы яндекс',
        'накрутка поведенческих факторов яндекс',
        'поведенческие факторы сайта',
        'сервис поведенческих факторов',
        'поведенческие факторы ранжирования',
        'топ накрутка поведенческих факторов',
        'накрутка пф поведенческих факторов',
        'накрутка поведенческих факторов топ мейкер',
        'накрутка поведенческих факторов скачать',
        'поведенческий фактор рф',
        'поведенческие факторы yatopeasy',
        'накрутка поведенческого фактора рф',
        'накрутка пф поведенческих факторов рф',
        'улучшение поведенческих факторов',
        'программа +для накрутки поведенческих факторов скачать',
        'накрутка поведенческих факторов сайта',
        '+чем крутить поведенческие факторы',
        'поведенческие факторы риска',
        'поведенческий фактор +на авито',
        'программа +для накрутки поведенческих факторов сайта',
        'относится поведенческим факторам',
        'поведенческие факторы factory',
        'поведенческий фактор софт',
        'купить поведенческие факторы',
        'повышение поведенческих факторов',
        'сервис +по накрутке поведенческих факторов',
        'накрутка поведенческих факторов программа быдлокодер',
        'накрутка поведенческого фактора авито',
        'софт +для накрутки поведенческих факторов',
        'приложение +для накрутки поведенческих факторов',
        'анализ поведенческих факторов',
        'заказать поведенческий фактор',
        'поведенческие факторы ранжирования factory',
        'оценка поведенческих факторов',
        'поведенческие факторы пф топ',
        'поведенческие факторы бот',
        'поведенческие факторы 2023',
        'поведенческо социальный фактор',
        'поведенческие факторы faktori',
        'поведенческие факторы здоровья',
        'поведенческие факторы seo',
        'программа поведенческий фактор',
        'накрутка поведенческих факторов программа',
        'программа +для накрутки поведенческих факторов скачать',
        'программа +для накрутки поведенческих факторов сайта',
        'накрутка поведенческих факторов программа быдлокодер',
        'накрутка пф программа поведенческий фактор',
        'скачать программа +для накрутки поведенческих факторов сайта',
        'накрутка поведенческих факторов программа gofuckbiz',
        'накрутка поведенческих факторов программа топ мейкер',
        'накрутка поведенческих факторов программа gofuckbiz 55316',
        'программа накрутки поведенческих факторов top maker',
        'накрутка поведенческих факторов программа топмейкер',
        'накрутка поведенческих факторов программа +за traff',
        'программа поведенческий фактор поведенческий фактор рф',
        'программа накрутки поведенческого фактора bumbastik',
        'накрутка поведенческих факторов программа топ мэйкер',
        'накрутка поведенческих факторов программа пф топ',
        'программы накрутки пф поведенческий фактор рф',
        'программа накрутки поведенческих факторов рф',
        'накрутка поведенческих факторов программа cleverteam',
        'программа накрутки поведенческих факторов клевер тим',
        'накрутка поведенческих факторов программа fasttop',
        'накрутка поведенческих факторов программа бомбастик',
        'программа накрутки поведенческого фактора seo +на взлет',
        'программа накрутки поведенческих факторов сео +на взлет',
        'программа поведенческий фактор бумабастик',
        'накрутка поведенческих факторов программа фастоп',
        'программа +для накрутки поведенческих факторов сайта bumbastik',
        'программа накрутки поведенческого фактора бумабастик',
        'накрутка поведенческих факторов программа фаст топ',
        'программа +для накрутки поведенческих факторов сайта бумабастик',
        'накрутка поведенческих факторов яндекс',
        'поведенческие факторы яндекс накрутка пф',
        'накрутка пф яндекс топ поведенческих факторов',
        'накрутка поведенческих факторов яндекс yatopeasy',
        'накрутка пф яндекс поведенческий фактор рф',
        'накрутка поведенческих факторов яндекс топ мейкер',
        'накрутка поведенческих факторов яндекс fast top',
        'накрутка поведенческих факторов яндекс бумабастик',
        'фильтр +за накрутку поведенческих факторов яндекс',
        'накрутка поведенческих факторов яндекс bumbastik',
        'накрутка поведенческих факторов яндекс 4 без',
        'накрутка поведенческих факторов яндекс услуги yatopeasy',
        'поведенческий фактор рф',
        'накрутка поведенческого фактора рф',
        'накрутка пф поведенческих факторов рф',
        'поведенческие факторы яндекс поведенческий фактор рф',
        'программа поведенческий фактор поведенческий фактор рф',
        'накрутка пф яндекс поведенческий фактор рф',
        'программы накрутки пф поведенческий фактор рф',
        'программа накрутки поведенческих факторов рф',
        'сео накрутка поведенческих факторов накрутка пф рф',
        'раскрутка поведенческими факторами накрутка пф рф',

      ],
    };
  },
  head() {
    return {
      title: this.title,
      meta: [
        {
          hid: "description",
          name: "description",
          content: this.description,
        },
      ],
    };
  },
  async created() {
    console.log();
    let id = this.$route.params.id;
    if (!id) {
      this.title = "накрутка пф поведенческих факторов";
    } else {
      const titleMeta = this.titleMeta[id];
      this.title = titleMeta + " в Санкт-Петербурге";
    }
    this.description =
      " накрутка поведенческих факторов seo сео оптимизация сервис для накрутки поведенческих факторов программа софт специалист мобильные устройства разные айпи yandex яндекс bot0";
  },
  async mounted() { },
};
</script>

<style scoped>
/*Обнуление*/
* {
  padding: 0;
  margin: 0;
  border: 0;
}

*,
*:before,
*:after {
  -moz-box-sizing: border-box;
  -webkit-box-sizing: border-box;
  box-sizing: border-box;
}

:focus,
:active {
  outline: none;
}

a:focus,
a:active {
  outline: none;
}

nav,
footer,
header,
aside {
  display: block;
}

html,
body {
  height: 100%;
  width: 100%;
  font-size: 100%;
  line-height: 1;
  font-size: 14px;
  -ms-text-size-adjust: 100%;
  -moz-text-size-adjust: 100%;
  -webkit-text-size-adjust: 100%;
}

input,
button,
textarea {
  font-family: inherit;
}

input::-ms-clear {
  display: none;
}

button {
  cursor: pointer;
}

button::-moz-focus-inner {
  padding: 0;
  border: 0;
}

a,
a:visited {
  text-decoration: none;
}

a:hover {
  text-decoration: none;
}

ul li {
  list-style: none;
}

img {
  vertical-align: top;
}

h1,
h2,
h3,
h4,
h5,
h6 {
  font-size: inherit;
  font-weight: 400;
}

/*--------------------*/

body {
  background-color: rgb(255, 255, 255);
  /* background-attachment: fixed; */
  font-family: "Montserrat", sans-serif;
}

/* модификатор */

.container--intro {
  max-width: 800px;
  margin: 0 auto;
}

.container--header {
  max-width: 460px;
  margin: 0 auto;
}

.header {
  background-color: black;
}

.header__inner {}

.header__title {
  text-align: center;
  color: #fff;
  padding: 60px 0;
  text-transform: uppercase;
  line-height: 1.5;
}

.header__nav {
  display: flex;
  justify-content: center;
  font-size: 11px;
  text-transform: uppercase;
  padding-bottom: 74px;
}

.header__link {
  color: #fff;
  margin-right: 24px;
  padding-bottom: 14px;
  border-bottom: 1px solid rgba(255, 255, 255, 0);
  transition: border 0.5s;
}

.header__link:last-child {
  margin-right: 0px;
}

.header__link:hover {
  border-bottom: 1px solid rgba(165, 165, 165, 0.605);
}

.intro__cart {
  /* background-image: url(/src/img/blogcard.png); */
  background-size: cover;
  background-repeat: no-repeat;
  border-radius: 5px 5px 0 0;
}

.intro__cart__title {
  font-size: 28px;
  color: black;
  padding: 220px 0 40px 60px;
}

.intro__text {
  /* background-color: rgb(131, 131, 131); */
  border: 1px solid;
  border-radius: 0 0 5px 5px;
}

.intro__content {
  color: rgb(0, 0, 0);
  padding: 36px 60px 44px 60px;
}

/* .intro__cart__perfect {
    background-image: url(/src/img/IMAGEcart.png);
    background-size: cover;
    background-repeat: no-repeat;
  }
  
  .intro__cart__we{
    background-image: url(/src/img/we.png);
    background-size: cover;
    background-repeat: no-repeat;
  }
  
  .subscription {
    display: flex;
    justify-content: center;
  }
  
  .subscription__title {
    color: #fff;
  }
  
  .subscription__btn {
    display: flex;
    justify-content: center;
  } */

.next__inner {
  padding: 50px;
  display: flex;
  justify-content: center;
}

.next__btn {
  padding: 10px 30px;
  border-radius: 5px;
  background-color: rgb(10, 173, 248);
}

.next__btn {
  color: #fff;
}

.footer {
  border-top: 1px solid #000;
}

.footer__inner {
  display: flex;
  justify-content: space-between;
  align-items: center;
}

.vk {
  margin-right: 5px;
}

@media (min-width: 900px) {
  body {
    width: 100%;
  }
}

@media (max-width: 600px) {
  .intro__cart__title {
    font-size: 35px;
    line-height: 1.5;
    padding: 220px 10px 40px 10px;
  }

  .intro__content {
    font-size: 20px;
    line-height: 1.5;
    padding: 36px 10px 44px 10px;
  }
}

@media (max-width: 480px) {
  .intro__cart__title {
    font-size: 30px;
    line-height: 1.5;
    padding: 220px 10px 40px 10px;
  }

  .intro__content {
    font-size: 20px;
    line-height: 1.5;
    padding: 36px 10px 44px 10px;
  }
}

@media (max-width: 390px) {
  .intro__cart__title {
    font-size: 29px;
    line-height: 1.5;
    padding: 220px 10px 40px 10px;
  }

  .intro__content {
    font-size: 20px;
    line-height: 1.5;
    padding: 36px 10px 44px 10px;
  }
}

@media (max-width: 300px) {
  .intro__cart__title {
    font-size: 15px;
    padding: 220px 10px 40px 10px;
  }
}

.next__btn {
  margin: 10px;
}

.next__inner {
  padding: 0px;
}</style>
